In [3]:
import pandas as pd
pd.read_excel('Student details.xlsx')

   ROLL no    NAME DEPARTMENT  CGPA
0       23   Damon        ECE   8.5
1       45   Klaus       Mech   8.6
2       48   Elena        CSE   8.7
3       50  Bonnie         IT   8.4
4       53  Stefan        EEE   8.3
5       51  Jeremy      Civil   8.0

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="shinchan",
)

mycursor = mydb.cursor()
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000019C99ED58B0>

In [5]:
dbse = mydb.cursor()

dbse.execute("CREATE DATABASE Students_managementSystem")

In [7]:
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="shinchan",
  database="Students_managementSystem"
)
dbse = mydb.cursor()

dbse.execute("CREATE TABLE student(ROLL_no INT(10),NAME VARCHAR(10), DEPARTMENT VARCHAR(25), CGPA INT(35))")

In [8]:
dbse = mydb.cursor()

dbse.execute("SHOW TABLES")

for value in dbse:
  print(value)

('student',)

In [9]:
cur = mydb.cursor()
cur.execute('SELECT * FROM student')
for row in cur:
    print(row)

In [10]:
import pandas as pd

df = pd.read_excel('Student details.xlsx')

In [15]:
import xlrd
import MySQLdb
xl_sheet = xlrd.open_workbook("Student-details.xls")
xl_sheet

In [16]:
sheet_name =xl_sheet.sheet_names()
sheet_name

['Sheet1']

In [17]:

mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="shinchan",
  database="Students_managementSystem"
)

cur = mydb.cursor()
for s in range(0,1):
    sheet=xl_sheet.sheet_by_index(s)
    sql= "INSERT INTO student(ROLL_no,NAME,DEPARTMENT,CGPA ) VALUES(%s,%s,%s,%s)"
    for r in range(1,sheet.nrows):
        ROLL_no =sheet.cell(r,0).value
        NAME =sheet.cell(r,1).value
        DEPARTMENT =sheet.cell(r,2).value
        CGPA=sheet.cell(r,3).value
        
    
        values =(ROLL_no,NAME,DEPARTMENT,CGPA )
        
        cur.execute(sql,values)
mydb.commit()

In [18]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM student")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(23, 'Damon', 'ECE', 9)
(45, 'Klaus', 'Mech', 9)
(48, 'Elena', 'CSE', 9)
(50, 'Bonnie', 'IT', 8)
(53, 'Stefan', 'EEE', 8)
(51, 'Jeremy', 'Civil', 8)

In [21]:
mycursor = mydb.cursor()

mycursor.execute("SELECT NAME FROM student WHERE CGPA >8")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Damon',)
('Klaus',)
('Elena',)